Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་ལོངས་སྤྱོད་པའི་ཕྱིར་ཡངས་ཤིང་མཉམ་པར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་གསུམ་པོ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. That place will bring the Tathāgata pleasure. This, Śāriputra, is the third wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེར་རྩྭ་སྔོ་བ། འཁྱིལ་པ། འཇམ་པ། གཡས་ཕྱོགས་སུ་འཁྱིལ་པ། ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་ བདེ་བ། དྲི་རབ་ཏུ་ཞིམ་པ་སྐྱེ་བར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བཞི་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. That place will be covered with soft green grass that will curl to the right as it grows and that will be as pleasant to the touch as fine fabric and will smell exquisite. This, Śāriputra, is the fourth wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེར་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུ་གྲང་བ། ཡང་བ། འཇམ་པ། དང་བ། རྙོག་པ་མེད་པ། རབ་ཏུ་དང་བ། འཐུང་འདོད་པ། མང་དུ་འཐུངས་ཀྱང་ནད་དུ་མི་འགྱུར་བ་ཡན་ལག་འདི་བརྒྱད་དང་ལྡན་པའི་ཆུ་འབྱུང་བར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་ད་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་ལྔ་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. In that place there will be water that possesses eight qualities: it will be soothing, agreeable, mild, clear, not murky, pure, delicious, and not harmful even if enjoyed in excess. These are the eight qualities the water will have. This, Śāriputra, is the fifth wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེར། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་རབ་ཏུ་བསིལ་བའི་རླུང་ལྡང་བ་དེ་འདི་ལྟ་སྟེ་དཔེར་ན། ཤཱ་རིའི་བུ་སོས་ཀའི་ཐ་མའི་ཟླ་བ་ཚ་བས་གདུངས་པའི་དུས་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་གང་གཱའི་ཀླུང་དུ་ཞུགས་ནས། ལུས་བསིལ་བར་བྱས་ཏེ། རིམས་དང་སྙོམ་པ་ཐམས་ཅད་ཞི་བར་བྱས་ནས་ གང་གཱའི་ཀླུང་ནས་བྱུང་ཞིང་སླར་བྱུང་ནས་འཆག་ཅིང་འགྲོ་བ་ལས་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན་ནགས་སྟུག་པོ་ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་གྲིབ་མ་སྟུག་པོ་དང་ལྡན་པ་ཞིག་མཐོང་ནས་ དེ་ནགས་སྟུག་པོ་གང་ན་ཡོད་པ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། ནགས་སྟུག་པོའི་དབུས་ན་ཁྲིའི་སྟེང་དུ་ཕྱར་བུ་བཏིང་བ། བེའུ་རས་ཀྱིས་གཡོགས་པ། ཀ་ཙ་ལིན་དི་ཀའི་གདིང་བ་བཏིང་བ། དེའི་སྟེང་དར་གྱིས་གཡོགས་པ། ཡ་ཏོག་མ་ཏོག་ཏུ་སྔས་དམར་པོ་བཤམས་པ་ཞིག་མཐོང་ནས་ དེ་དེ་ལ་འདུག་གོ ། དེ་དེ་ལ་འདུག་སྟེ། འགྲེང་ཞིང་ཕྱོགས་བཞི་ཀུན་ནས་བསིལ་བའི་རླུང་ལྡང་བར་འགྱུར་བ་དེ་བཞིན་དུ། ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེར་བསིལ་བའི་རླུང་ལྡང་བར་འགྱུར་ཏེ། ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་དྲུག་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. A soothing breeze will blow in that place because of the ripening of the fruits of the Tathāgata’s previous actions. Śāriputra, take the example of a person who, during the scorching heat of the last month of summer, immerses his body in the river Ganges to cool down and to remove all his aches and fatigue and then rises from the river Ganges again and resumes his journey. Not long after this, he sees a great thick forest, where branches laden with leaves and petals provide dense shade. He approaches the thick forest, and having entered it, he comes across a throne in the middle of the forest covered with a reed mat and linen, bedecked with the finest fabrics, and with red silken cushions placed on top of the fabrics on either side. He takes his seat there and rests, and a soothing breeze comes from the four directions. Śāriputra, the soothing breeze that will blow in that place will be exactly like this. This, Śāriputra, is the sixth wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེར་ཆུ་ལས་སྐྱེ་བའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུད་དང་། པད་མ་དཀར་པོ་སྐྱེ་བར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བདུན་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ།
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. In that place aquatic flowers such as blue, red, pink, and white lotuses will appear. This, Śāriputra, is the seventh wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་དུ་འབར། ཀུན་དུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས། འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེར་ཐང་ལས་སྐྱེས་པའི་མེ་ཏོག་འདི་ལྟ་སྟེ། ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཙམ་པ་ཀ་དང་། སྣ་མའི་མེ་ཏོག་དང་། བ་རི་ཤ་ཀ་དང་། མྱ་ངན་འཚང་དང་། སྐྱ་སྣར་དང་། དོང་ཀའི་མེ་ཏོག་དང་། ཏ་ར་ནི་དང་། གོཏ་ར་ནི་ལ་སོགས་པ་ཐང་ལས་སྐྱེས་པའི་མེ་ཏོག་སྣ་ཚོགས་ཁ་དོག་དང་ལྡན་པ། དྲི་དང་ལྡན་པ་འབྱུང་བར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་བརྒྱད་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. In that place, plants such as atimuktaka shrubs, champak, chrysanthemum, jasmine, ashoka trees, trumpet-flower trees, karnikara flowers, crown flowers, gotaraṇī flowers, and so forth will appear. These and other beautifully formed and exquisite-smelling plants will appear. This, Śāriputra, is the eighth wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འབར། ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས་ འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེ་སྲ་ཞིང་མི་ཤིགས་པ། ས་གཞི་རྡོ་རྗེར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ནི་ངོ་མཚར་དང་རྨད་ཀྱི་ཆོས་དགུ་པ་འདི་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in that world that burns, blazes, and flames up like a single mass of fire, in that place, the Tathāgata will walk, stand, sit, and lie down. That place will be like a vajra, firm and unbreakable. This, Śāriputra, is the ninth wondrous and extraordinary property that place will possess.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལམ་མེ། རབ་ཏུ་ལམ་མེ། ཀུན་ཏུ་རབ་ཏུ་ལམ་མེ། འབར་ཀུན་ཏུ་འབར། ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་ཏེ། འབར་བ་གཅིག་ཏུ་གྱུར་ནས། འཚིག་པ་དེར་ས་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། མནལ་བའི་ས་ཕྱོགས་དེ་ལྷར་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དུ་བཅས་པ་དང་ཚངས་པར་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོད་རྟེན་དུ་འགྱུར་ཏེ ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ངོ་མཚར་དང་། རྨད་ཀྱི་ཆོས་བཅུ་བོ་འདི་དང་ལྡན་པར་འགྱུར་ཏེ། ཤཱ་རིའི་བུ་ས་ཕྱོགས་དེ་ནི་ངོ་མཚར་དང་། རྨད་ཀྱི་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, in this world of the threefold thousand great thousand worlds, which is glowing, shining, and illuminated, burning, blazing, flaming up, and alight like a single mass of fire, in that place, the tathāgata, arhat, fully accomplished Buddha will walk, stand, sit, and lie down. In that place there will be places of worship for the world with its gods, with its māras, with its brahmās, with its ascetics and brahmins, with its gods, human beings, and asuras. This, Śāriputra, is the tenth wondrous and extraordinary property that place will possess.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་རྟོགས་ཏེ། དེ་རྟོགས་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་ལྟར་མཉམ་པར་གཞག་པའི་སེམས་ལ་གཅིག་ཏུ་བདེ་བར་སོ་སོར་ཡང་དག་པར་མྱོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བཞུགས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་འབྲི་བ་མེད་པར་ངས་བཤད་དོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བསོད་སྙོམས་གཅིག་གིས་བསྐལ་པར་གནས་སམ། བསྐལ་པ་བརྒྱ་འམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་སྟོང་ཕྲག་བརྒྱ་འམ། བསྐལ་པ་བྱེ་བའམ། བསྐལ་པ་བྱེ་བ་བརྒྱ་འམ། བསྐལ་པ་བྱེ་བ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་འམ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ངམ། དེ་ལས་ལྷག་པར་ཡང་བཞུགས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག་གི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ། དེ་ལྟར་མཐུ་ཆེ། དེ་ལྟར་དབང་ཆེ་བར་གྲགས་པའོ། །
en: “These then, Śāriputra, are the ten wondrous and extraordinary qualities that this place will possess. Why is this? It is because the Tathāgata has awoken to the totality of phenomena, and with this awakening the tathāgata, arhat, fully accomplished Buddha is able to settle in a kind of concentration wherein the mind is composed to such a degree that he will exclusively experience joy. I say to you, even if he were to remain in this state for as many eons as there are grains of sand in the river Ganges, there would be no deterioration in the Tathāgata’s concentration. Śāriputra, even if the Tathāgata had only one bowlful of alms to sustain him, he could remain in this state for an eon, for a hundred eons, for a thousand eons, for a hundred thousand eons, for ten million eons, for a billion eons, for a thousand billion eons, for a hundred thousand million billion eons, or even much longer than that. How can he do this? He can do this, Śāriputra, because the tathāgata, arhat, fully accomplished Buddha has attained the highest possible degree of perfection in the supreme perfections. He possesses great magical abilities and has great authority. He is a great lord.

source: འདི་ལྟ་སྟེ། དཔེར་ན་ཤཱ་རིའི་བུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་སྐྱེ་མཆེད་ཀྱི་ལྷའི་ནང་དུ་ལྷའི་བུ་སྐྱེས་པ་དེ་དམིགས་པ་གཅིག་ལ་གནས་པའི་རྣམ་པར་ཤེས་པས་བསྐལ་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་འདུག་སྟེ བསམ་གཏན་གྱིས་ཚེའི་མཐའ་འཆི་བའི་དུས་མ་བྱས་ཀྱི་བར་དུ་རྣམ་པར་ཤེས་པ་དེ་ལས་རྣམ་པར་ཤེས་པ་གཞན་དུ་མི་འགྱུར་རོ། ། དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་གང་གི་ནུབ་མོ་དེ་བཞིན་གཤེགས་པས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། གང་གི་ནུབ་མོ་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་བར་དུ་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་ལས་ཉམས་པ་མེད། སེམས་འགྱུར་བ་མེད། སེམས་རྒྱུ་བ་མེད། སེམས་རྣམ་པར་རྒྱུ་བ་མེད། སེམས་རབ་ཏུ་རྒྱུ་བ་མེད། སེམས་རྒྱས་པ་མེད། སེམས་ཀྱི་འདྲེན་པ་མེད། སེམས་གཡེང་བ་མེད། སེམས་མཐོ་བ་མེད། སེམས་དམའ་བ་མེད། སེམས་ཀུན་ཏུ་སྲུང་བ་མེད། སེམས་སྦེད་པ་མེད། སེམས་ཚིམ་པ་མེད། སེམས་མི་འཐུན་པ་མེད། སེམས་འདུད་པ་མེད། སེམས་གཡོ་བ་མེད། སེམས་རབ་ཏུ་དགའ་བར་བྱེད་པ་མེད། སེམས་ཞུམ་པ་མེད། སེམས་རྟོག་པ་མེད། སེམས་རྣམ་པར་རྟོག་པ་མེད། སེམས་ཡོངས་སུ་རྟོག་པ་མེད། སེམས་ཀྱི་རྗེས་སུ་འབྲང་བའི་རྣམ་པར་ཤེས་པ་མེད། སེམས་མིག་ལ་གནས་པ་མེད། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་གནས་པ་མེད། སེམས་གཟུགས་ལ་གནས་པ་མེད། སེམས་སྒྲ་དང་དྲི་དང་། རོ་དང་། རེག་བྱ་དང་ཆོས་ལ་གནས་པ་མེད། སེམས་ཆོས་ལ་འཇུག་པ་མེད། སེམས་རྣམ་པར་ཤེས་པ་ལ་འཇུག་པ་མེད། སེམས་འདས་པ་ལ་ཡང་མི་ལྟ། སེམས་མ་འོངས་པ་ལ་ཡང་མི་ལྟ། སེམས་ད་ལྟར་བྱུང་བ་ལ་ཡང་མི་ལྟ་སྟེ། དེ་ལྟར་ན་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏིང་ངེ་འཛིན་ལ་གནས་ནས། སེམས་ལས་ཆོས་གང་ཡང་བཙལ་བ་མེད་མོད་ཀྱི། ལྷུན་གྱིས་གྲུབ་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་གོ ། འདི་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་དང་བྲལ་མོད་ཀྱི་གནས་ཀྱང་མི་འདོར་ཏེ། ལྷུན་གྱིས་གྲུབ་པའི་ཚུལ་གྱིས་སངས་རྒྱས་ཀྱི་བྱ་བ་ཐམས་ཅད་ཀྱང་མཛད་དོ། །
en: “Śāriputra, take the example of a child of the gods born among the gods of the Heaven of Neither Perception nor Nonperception. His consciousness remains unwaveringly in this state for eighty-four thousand eons. His consciousness does not stray anywhere else as long as his lifespan in this state of concentration has not reached its end. In just the same way, Śāriputra, in that period, from the night the Tathāgata became a fully realized, fully accomplished buddha, the night on which he attained complete nirvāṇa within the sphere of nirvāṇa without remainder, the Tathāgata’s concentration was not broken. His mind did not move. His mind did not flutter. His mind did not stray. His mind did not wander. His mind was not scattered. His mind was not swayed. His mind was not dispersed. His mind was not elevated. His mind did not sink down. His mind was not on guard. His mind was not defensive. His mind was not overjoyed. His mind was not stubborn. His mind was not submissive. His mind was not agitated. His mind enjoyed no pleasures. His mind was not discouraged. His mind made no mental constructions. His mind did not conceptualize. His mind did not make assumptions. His mind did not become lost in trains of thought. His mind did not dwell on the eyes, nor did it dwell on the ears, the nose, the tongue, the body, or the intellect. His mind did not dwell on forms, nor did it dwell on sounds, smells, tastes, physical objects, or mental objects. His mind did not become involved with phenomena. His mind did not become involved with consciousness. His mind also had no concern for the past. His mind had no concern for the future. His mind had no concern for the present. Śāriputra, such was the state of concentration the tathāgata, arhat, fully accomplished Buddha was in. Even though he did not seek out any phenomena, the unimpeded insight of his knowledge could engage effortlessly with all phenomena. Thus, Śāriputra, the stability of the Tathāgata’s concentration, beyond thoughts, mind, and consciousness, cannot be shattered, and he carries out all buddha activities effortlessly.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ། བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ནས། སྟོན་པ་ཡང་འདི་སྐད་གསུང་ངོ་། །
en: This is what the Lord said. After the Sugata had said this, he, the teacher, continued as follows:

source: བསྐལ་པ་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་ཅིང་གཞལ་ཡས་པར། །སྔོན་གྱི་སྲིད་པའི་འགྲོ་བར་བྱང་ཆུབ་སྤྱོད་སྤྱད་ཚེ། །ཚུལ་ཁྲིམས་དང་ནི་ཐོས་དང་ཏིང་འཛིན་བག་ཡོད་དང་། །བཟོད་པ་དག་ཀྱང་བྱང་ཆུབ་མཆོག་ཕྱིར་འདྲེན་པས་བསྒོམས། །
en: “In previous lives, for hundreds of thousands of immeasurable, Incomprehensible eons, he practiced the way of awakening. To reach supreme awakening, the leader trained In morality, learning, concentration, and patient acceptance.

source: རྒྱལ་བའི་རྟོགས་དང་འབྲས་བུ་དགེ་བ་འདི་འདྲ་བས། །ཚུལ་ཁྲིམས་ཤིན་ཏུ་ཡོངས་དག་འཇིག་རྟེན་ཀུན་གྱི་མཆོག །ཇི་ལྟར་ནམ་མཁའ་དྲི་མེད་རྣམ་པར་སྤྲོས་མེད་ལྟར། །སྟོབས་བཅུའི་ཚུལ་ཁྲིམས་དྲི་མ་མེད་པ་ནམ་མཁའ་བཞིན། །གང་གི་ནུབ་མོ་རྒྱལ་བས་དང་པོ་བྱང་ཆུབ་རྟོགས། །
en: “The Victorious One’s goodness resulting from previous actions Is such that his morality is supremely pure, unique in all the world. Just as space remains pure and free from defects and complications, He who possesses ten powers is space-like, free from defects. “From the night that the Victorious One realized awakening

source: གང་གི་ནུབ་མོ་ཐ་མར་མྱ་ངན་འདས་གཤེགས་ཚེ། །སྟོབས་བཅུ་རྣམས་ལ་སེམས་རྒྱུ་རབ་ཏུ་རྒྱུ་བ་མེད། །
en: Until the final night of nirvāṇa, Never did the mind of the one of ten powers flutter or wander.

source: དེ་བཞིན་བསམ་གཏན་ཏིང་འཛིན་ཉམས་པ་ནམ་ཡང་མེད། །
en: Never was the focus of his concentration broken.

source: སྟོབས་བཅུ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཕུང་པོ་ཉམས་མེད་དེ། །
en: “The morality of one who possesses ten powers is never given up;

source: རྫུ་འཕྲུལ་སྟོབས་དང་རྣམ་ཐར་ཉམས་པའི་ཆར་འགྱུར་མེད། །
en: There is no decay in his magical powers or freedoms.

source: བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་དུ་སེམས་ནི་གཅིག་གིས་གནས། །
en: The leader can remain one-pointedly focused for a hundred thousand eons

source: འདྲེན་པ་ལ་ནི་རྟོག་དང་རྣམ་པར་རྟོག་པ་མེད། །
en: Without engaging in mental constructions or conceptualization.

source: འདྲེན་པ་རྣམས་ཀྱི་རྣམ་རྟོག་སྤྱོད་ཡུལ་ནམ་མཁའ་འདྲ། །
en: “The conceptual range of the leader is like the sky;

source: དུས་གསུམ་དག་ལ་སངས་རྒྱས་ཡེ་ཤེས་ཐོགས་མེད་འཇུག །
en: The Buddha’s knowledge can penetrate the three times without impediment.

source: སྟོབས་བཅུ་རྣམས་ལ་སེམས་ཡིད་རྣམ་པར་རྒྱུ་བ་དང་། །རྟོག་དང་སྟོང་པ་མེད་པར་སངས་རྒྱས་སྲས་རྣམས་དང་། །
en: The mind of the one of ten powers does not stray, does not form mental constructions, And is not scattered. The sons and daughters of the Buddha have faith in this.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “This, Śāriputra, is why the bodhisatva has great faith in the tathāgatas, given their inconceivable tathāgata morality and concentration. This is why he trusts them, has confidence in them, and does not doubt them. This is why the tathāgatas bring him pleasure, joy, and satisfaction, and why he considers them to be truly wondrous and extraordinary.

source: ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས། ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན།
en: “Now, Śāriputra, what is it about the tathāgatas’ inconceivable magical tathāgata-abilities that leads the bodhisatva to have great faith in them? What is it that causes him to trust and have confidence in them and not to doubt them? What is it that brings him pleasure, joy, and satisfaction, and leads him to consider the tathāgatas to be truly wondrous and extraordinary?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་འདི་སྐད་དུ་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འདི་ནི་ངའི་ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེ་བའི་ནང་ན་མཆོག་གོ་ཞེས་གསུངས་ཏེ བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་རྫུ་འཕྲུལ་དེ་ལ་འཇལ་ཞིང་ཡོངས་སུ་དཔྱོད། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ལ་ཡང་འཇལ་ཞིང་ཡོངས་སུ་དཔྱོད་དོ། ། གཞལ་ཏེ་ཡོངས་སུ་དཔྱད་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་དང་མཚུངས་ཤིང་མཉམ་པར་མ་མཐོང་ངོ་། ། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ལ་འཇལ་ལ་གཞལ་ཅིང་ཡོངས་སུ་དཔྱད་ནས་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ལ་འཇལ་ཞིང་ཡོངས་སུ་དཔྱོད་དོ། །གཞལ་ཏེ་ཡོངས་སུ་དཔྱད་ནས་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་དང་མཚུངས་ཤིང་མཉམ་པར་མ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ་སྙམ་ནས་ དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་རྒྱ་ཆེར་བརྩོན་འགྲུས་རྩོམ་མོ། །
en: “Śāriputra, the tathāgata, arhat, fully accomplished Buddha has said that when it comes to śrāvakas who possess great magical abilities, the best among the mendicants is the elder Mahāmaudgalyāyana. If a bodhisatva assesses and examines the magical abilities first of a śrāvaka and then of a bodhisatva, he will not be able to say that the magical abilities of the śrāvaka can compare to those of the bodhisatva. If he then assesses and examines the magical abilities first of a bodhisatva and then of the tathāgatas, he will not be able to claim that the magical abilities of the bodhisatva can compare to those of the tathāgatas. He will then conclude that the magical tathāgata-abilities of the tathāgatas are inconceivable, and that their magical tathāgata-abilities are perfected by means of the application of great vigor.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ལས་བརྩམས་ཏེ་ དཔེ་ཙམ་དུ་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ལས་ཁྱོད་ཉན་པར་འདོད་དམ། བཅོམ་ལྡན་འདས་དེའི་དུས་འདི་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དེའི་ཚོད་ལགས་སོ།
en: “Śāriputra, would you like to hear an example related to the magical tathāgata-abilities of the tathāgatas?”

source: །འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་ལས་བརྩམས་ཏེ་ དཔེ་བཤད་ན། དགེ་སློང་རྣམས་བཅོམ་ལྡན་འདས་ལས་དེ་ཐོས་ནས་དེ་བཞིན་དུ་འཛིན་པར་འགྱུར་རོ། །
en: He answered, “This is the time, Lord; this is the occasion, Sugata, for you to provide an example of the magical tathāgata-abilities to the mendicants in the presence of the Lord, so that the mendicants listening to the Lord will understand the way things are.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེའི་ཕྱིར་ཤཱ་རིའི་བུ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། ། བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས།
en: The Lord said, “Then, Śāriputra, listen well and take to heart what I have to say.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: The elder Śāriputra said, “Of course, Lord,” and listened attentively to the Lord.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རྫུ་འཕྲུལ་ཆེ་བ་ཡིན་ནམ་གསོལ་པ། དགེ་སློང་ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེ་བའི་ནང་ན་འདི་ལྟར་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འདི་ནི་མཆོག་གོ་ཞེས་བདག་གིས་བཅོམ་ལྡན་འདས་ལས་མངོན་སུམ་དུ་ཐོས་ཏེ་ མངོན་སུམ་དུ་བཟུང་ངོ་། །
en: The Lord then asked, “Śāriputra, do you think that the elder Mahāmaudgalyāyana possesses great magical abilities?” He answered, “I have heard directly from the Lord and understood it to be so, that when it comes to śrāvakas whose magical abilities are great, the best among the mendicants is the elder Mahāmaudgalyāyana.”

source: བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེན་པོ་མཽད་གལ་གྱི་བུ་ལྟ་བུས་འདི་ལྟ་སྟེ་དཔེར་ན། བུ་རམ་ཤིང་སྟུག་པོའམ། འདམ་བུ་སྟུག་པོ་འམ། འོད་མ་སྟུག་པོའམ། ཏིལ་གྱི་ཞིང་ངམ། འབྲས་ཀྱི་ཞིང་བཞིན་དུ་གང་བར་གྱུར་ལ། དེ་ལྟར་གཅིག་ཏུ་འདུས་པའི་ཉན་ཐོས་ཀྱི་ཚོགས་དེ་ལྟ་བུས་མཐུ་དང་བརྩོན་འགྲུས་ཐམས་ཅད་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གྱི་སྟོབས་ཐམས་ཅད་བསྟན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཆོ་འཕྲུལ་གྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ ། སྟོང་གི་ཆར་ཡང་། བརྒྱ་སྟོང་གི་ཆར་ཡང་། བྱེ་བའི་ཆར་ཡང་། བྱེ་བ་བརྒྱའི་ཆར་ཡང་། བྱེ་བ་སྟོང་གི་ཆར་ཡང་། བྱེ་བ་བརྒྱ་སྟོང་གི་ཆར་ཡང་། གྲངས་སུ་ཡང་། ཆར་ཡང་། བགྲང་བར་ཡང་། དཔེར་ཡང་། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་གྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའོ། །
en: “Śāriputra, imagine that śrāvakas like Maudgalyāyana, whose magical abilities are great, filled the threefold thousand great thousand worlds like dense forests of sugarcane, forests of reeds, forests of bamboo, fields of sesame, and fields of rice. Then, Śāriputra, if one were to see all the combined strength and vigor, all the magical and miraculous abilities of such a host of śrāvakas, it would not compare to even a hundredth part of the miraculous abilities of the Tathāgata. It would not be considered to be, be seen to be part of, be reckoned as, be compared to, or resemble even a three thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, or a thousand billionth part. How is this possible? Śāriputra, it is because the tathāgata, arhat, fully accomplished Buddha has attained the highest possible degree of perfection in the perfection of magical abilities.
